docs/org/kidsloop-token.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-15 Wed 18:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KidsLoop JWT Token</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Axel Wettervik" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">KidsLoop JWT Token</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0fa8c08">1. Token Format</a>
<ul>
<li><a href="#orgaebb34f">1.1. Token payload</a></li>
<li><a href="#org3bac4b1">1.2. Token credentials</a></li>
</ul>
</li>
<li><a href="#org29b734c">2. Client (Web Application)</a>
<ul>
<li><a href="#orgd98ba66">2.1. Examples</a>
<ul>
<li><a href="#org980eb57">2.1.1. Setting token</a></li>
<li><a href="#orgfd4f67e">2.1.2. Reading token</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga424bff">3. Server</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0fa8c08" class="outline-2">
<h2 id="org0fa8c08"><span class="section-number-2">1</span> Token Format</h2>
<div class="outline-text-2" id="text-1">
<p>
The KidsLoop token is a JWT token with some additional fields. A good
resource where developers can experiment with JWT tokens is:
<a href="https://jwt.io">https://jwt.io</a>.
</p>
</div>

<div id="outline-container-orgaebb34f" class="outline-3">
<h3 id="orgaebb34f"><span class="section-number-3">1.1</span> Token payload</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-js">{
    <span style="color: #586e75;">// </span><span style="color: #586e75;">Standard JWT fields:</span>
    sub: string <span style="color: #586e75;">// </span><span style="color: #586e75;">subject -&gt; not specified yet</span>
    iss: string <span style="color: #586e75;">// </span><span style="color: #586e75;">issuer -&gt; Used to identify who created this token. Will be used during verification process.</span>
    aud: string <span style="color: #586e75;">// </span><span style="color: #586e75;">audience -&gt; not specified yet</span>
    exp: number <span style="color: #586e75;">// </span><span style="color: #586e75;">expire time -&gt; Used to detect if token is expired during verification process.</span>
    nbf: number <span style="color: #586e75;">// </span><span style="color: #586e75;">not before -&gt; Used to detect if token isn't valid yet during verification process.</span>
    iat: number <span style="color: #586e75;">// </span><span style="color: #586e75;">issued at -&gt; The time token was issued.</span>

    <span style="color: #586e75;">// </span><span style="color: #586e75;">KidsLoop fields:</span>
    name: string <span style="color: #586e75;">// </span><span style="color: #586e75;">user name</span>
    roomid: string <span style="color: #586e75;">// </span><span style="color: #586e75;">which room the user is allowed to participate in using this token.</span>
    userid: string <span style="color: #586e75;">// </span><span style="color: #586e75;">unique identifier for the user.</span>
    teacher: <span style="color: #b58900;">boolean</span> <span style="color: #586e75;">// </span><span style="color: #586e75;">indicates if the user is a teacher or not.</span>
    org: string <span style="color: #586e75;">// </span><span style="color: #586e75;">indicates which organization this user is part of.</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3bac4b1" class="outline-3">
<h3 id="org3bac4b1"><span class="section-number-3">1.2</span> Token credentials</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Each organization or entity wanting to generate KidsLoop compatible
tokens have to register some information the KidsLoop servers will use
to verify the token and authenticate the user. Currently this
registration will happen manually but in the future we want to have an
online service for this.
</p>

<p>
The credentials should not be shared with end- users or be available to
any client (web application).
</p>

<div class="org-src-container">
<pre class="src src-js">{
    id: string <span style="color: #586e75;">// </span><span style="color: #586e75;">Issuer ID -&gt; This field should be the same value as the 'iss' field in token payload. Server will use this ID to find the correct credentials.</span>
    issuer: string | string[] <span style="color: #586e75;">// </span><span style="color: #586e75;">Array of allowed issuers. Currently this will likely always be the same value as the 'id' field.</span>
    algorithms: Algorithm[] <span style="color: #586e75;">// </span><span style="color: #586e75;">Array of allowed encryption algorithms. Should just contain the algorithms used when creating the signed token data.</span>
    certificate: string | Buffer <span style="color: #586e75;">// </span><span style="color: #586e75;">The public key used to verify the token signature (might be different based on algorithm used).</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29b734c" class="outline-2">
<h2 id="org29b734c"><span class="section-number-2">2</span> Client (Web Application)</h2>
<div class="outline-text-2" id="text-2">
<p>
The client will try to receive the token either from URL search
parameters or from `localStorage`. The key in localStorage or search
parameters should be `token`.
</p>
</div>

<div id="outline-container-orgd98ba66" class="outline-3">
<h3 id="orgd98ba66"><span class="section-number-3">2.1</span> Examples</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Example token: <span class="underline">ABCD</span>
</p>
</div>

<div id="outline-container-org980eb57" class="outline-4">
<h4 id="org980eb57"><span class="section-number-4">2.1.1</span> Setting token</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org727fb14"></a>URL Search Parameters<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
<a href="https://live.kidsloop.net/?token=ABCD">https://live.kidsloop.net/?token=ABCD</a>
</p>
</div>
</li>


<li><a id="orgea5f3c4"></a>Local Storage<br />
<div class="outline-text-5" id="text-2-1-1-2">
<div class="org-src-container">
<pre class="src src-js">localStorage.setItem(<span style="color: #2aa198;">'token'</span>, <span style="color: #2aa198;">'ABCD'</span>);
</pre>
</div>
</div>
</li>
</ol>
</div>


<div id="outline-container-orgfd4f67e" class="outline-4">
<h4 id="orgfd4f67e"><span class="section-number-4">2.1.2</span> Reading token</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="org7c7749d"></a>URL Search Parameters<br />
<div class="outline-text-5" id="text-2-1-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">url</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">URL</span>(window.location.href);
<span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">token</span> = url.searchParams.get(<span style="color: #2aa198;">'token'</span>);
</pre>
</div>
</div>
</li>

<li><a id="org5c01abc"></a>Local Storage<br />
<div class="outline-text-5" id="text-2-1-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">token</span> = localStorage.getItem(<span style="color: #2aa198;">'token'</span>);
</pre>
</div>
</div>
</li>

<li><a id="org161eae1"></a>Helper Function<br />
<div class="outline-text-5" id="text-2-1-2-3">
<p>
Reading the token can also be done using a helper function in the
AuthTokenProvider class. The AuthTokenProvider exists in the KidsLoop
web application source code. The helper function will try to retrieve
the token from both URL and local storage. It will prefer URL if token
exists in both places.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">token</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">AuthTokenProvider</span>()
                    .retrieveToken();
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga424bff" class="outline-2">
<h2 id="orga424bff"><span class="section-number-2">3</span> Server</h2>
<div class="outline-text-2" id="text-3">
<p>
The server will read the token from the HTTP request authorization
header. It will expect the authorization header to contain the token
in bearer format; 'Authorization: Bearer &lt;token&gt;'.
</p>

<p>
After receiving a token the server will try to parse and verify the
token. An immutable data container will be created by the server which
can be passed around and used to get information about the user.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900; font-weight: bold;">class</span> UserInformation {
    id: string
    name: string
    isTeacher: <span style="color: #b58900;">boolean</span>
    organization: string | <span style="color: #268bd2; font-weight: bold;">undefined</span>
}

<span style="color: #859900; font-weight: bold;">class</span> RoomInformation {
    roomId: string
}

<span style="color: #859900; font-weight: bold;">interface</span> IDecodedToken {
    isValid () : <span style="color: #b58900;">boolean</span>
    isExpired () : <span style="color: #b58900;">boolean</span>

    getSubject () : string
    getAudience () : string

    userInformation () : UserInformation | <span style="color: #268bd2; font-weight: bold;">undefined</span>
    roomInformation () : RoomInformation | <span style="color: #268bd2; font-weight: bold;">undefined</span>
}
</pre>
</div>

<p>
The decoded token data is kept around even if the token wasn't
verified properly. The reason for that is server might want to return
some specific error based on the data that failed to verify. For
example a different response if the token is expired or if the user
isn't allowed in the requested room.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Axel Wettervik</p>
<p class="date">Created: 2020-07-15 Wed 18:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
